3. Merging and Joining Datasets
- Merge two DataFrames based on a common key and fill any missing values in the resulting DataFrame.
- Perform a left join on two DataFrames with different keys and handle missing data in the result.
- Concatenate two DataFrames along the columns and handle any duplicate column names.

In [2]:
import pandas as pd
import numpy as np

In [7]:
df1 = pd.DataFrame({
    'car_id': range(1, 11),
    'brand': ['Ford', 'Toyota', 'BMW', 'Honda', 'Audi', 'Kia', 'Hyundai', 'Mazda', 'Nissan', 'Chevy'],
    'year': [2010, 2012, 2015, 2018, 2011, 2013, 2016, 2017, 2014, 2019],
    'price': [5000, 7000, 15000, 12000, 9000, 8000, 11000, 10000, 9500, 13000]
})

df2 = pd.DataFrame({
    'car_id': [5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
    'model': ['A4', 'Rio', 'Elantra', '3', 'Altima', 'Malibu', 'Civic', 'Focus', 'X5', 'Camry'],
    'color': ['Red', 'Blue', 'Black', 'White', 'Gray', 'Silver', 'Green', 'Yellow', 'Black', 'White'],
    'mileage': [60000, 40000, 30000, 25000, 50000, 35000, 45000, 30000, 20000, 55000]
})

In [4]:
df1.head()

   car_id   brand  year  price
0       1    Ford  2010   5000
1       2  Toyota  2012   7000
2       3     BMW  2015  15000
3       4   Honda  2018  12000
4       5    Audi  2011   9000

In [5]:
df2.head()

   car_id    model  color  mileage
0       5       A4    Red    60000
1       6      Rio   Blue    40000
2       7  Elantra  Black    30000
3       8        3  White    25000
4       9   Altima   Gray    50000

In [8]:
merged = pd.merge(df1, df2, on='car_id', how='inner')
merged = merged.fillna('missing')
merged

   car_id    brand  year  price    model   color  mileage
0       5     Audi  2011   9000       A4     Red    60000
1       6      Kia  2013   8000      Rio    Blue    40000
2       7  Hyundai  2016  11000  Elantra   Black    30000
3       8    Mazda  2017  10000        3   White    25000
4       9   Nissan  2014   9500   Altima    Gray    50000
5      10    Chevy  2019  13000   Malibu  Silver    35000

In [9]:
left_join = pd.merge(df1, df2, left_on='car_id', right_on='car_id', how='left')
left_join = left_join.fillna('missing')
left_join

   car_id    brand  year  price    model    color  mileage
0       1     Ford  2010   5000  missing  missing  missing
1       2   Toyota  2012   7000  missing  missing  missing
2       3      BMW  2015  15000  missing  missing  missing
3       4    Honda  2018  12000  missing  missing  missing
4       5     Audi  2011   9000       A4      Red  60000.0
5       6      Kia  2013   8000      Rio     Blue  40000.0
6       7  Hyundai  2016  11000  Elantra    Black  30000.0
7       8    Mazda  2017  10000        3    White  25000.0
8       9   Nissan  2014   9500   Altima     Gray  50000.0
9      10    Chevy  2019  13000   Malibu   Silver  35000.0

In [10]:
concat = pd.concat([df1, df2], axis=1)
concat = concat.loc[:,~concat.columns.duplicated()]
concat

   car_id    brand  year  price    model   color  mileage
0       1     Ford  2010   5000       A4     Red    60000
1       2   Toyota  2012   7000      Rio    Blue    40000
2       3      BMW  2015  15000  Elantra   Black    30000
3       4    Honda  2018  12000        3   White    25000
4       5     Audi  2011   9000   Altima    Gray    50000
5       6      Kia  2013   8000   Malibu  Silver    35000
6       7  Hyundai  2016  11000    Civic   Green    45000
7       8    Mazda  2017  10000    Focus  Yellow    30000
8       9   Nissan  2014   9500       X5   Black    20000
9      10    Chevy  2019  13000    Camry   White    55000